러닝스푼즈_ 파이썬데이터분석마스터_by장남수 4주차
판다스기초_1

In [1]:
import pandas as pd   # 설치가 안되어 있을 경우 ! pip install pandas
import numpy as np

In [ ]:
# 데이터 불러오기  --> 살펴보기
pd.read_excel()
pd.read_csv()
# pd.read_<tab> : 사용 가능 기능들 확인 가능

In [2]:
data = pd.read_excel('./data/exam.xlsx')

In [3]:
data

   번호  국어   영어  수학
0  1번  70   80  75
1  2번  68   95  55
2  3번  90  100  95

In [4]:
#data.head()   윗부분의 자료를 보여주며 최대 5줄 보여줌
data.head()

   번호  국어   영어  수학
0  1번  70   80  75
1  2번  68   95  55
2  3번  90  100  95

In [5]:
# data.tail()   아랫부분의 자료를 보여주며 최대 5줄 보임 
data.tail()

   번호  국어   영어  수학
0  1번  70   80  75
1  2번  68   95  55
2  3번  90  100  95

In [7]:
data.sample()
#data.sample(2)

   번호  국어  영어  수학
0  1번  70  80  75

In [8]:
# 데이터 요약해서 보기 : data.info() / data.describe()
data.info()    # 몇개가 있고 형태를 알려줌. 데이터의 구조 확인

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   번호      3 non-null      object
 1   국어      3 non-null      int64
 2   영어      3 non-null      int64
 3   수학      3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

In [9]:
data.describe()   # 컬럼별로 분포(평균,표준편차, 최대값, 4분위수 등)를 알려준다.

              국어          영어    수학
count   3.000000    3.000000   3.0
mean   76.000000   91.666667  75.0
std    12.165525   10.408330  20.0
min    68.000000   80.000000  55.0
25%    69.000000   87.500000  65.0
50%    70.000000   95.000000  75.0
75%    80.000000   97.500000  85.0
max    90.000000  100.000000  95.0

### 데이터 선택하기

In [10]:
data.head()

   번호  국어   영어  수학
0  1번  70   80  75
1  2번  68   95  55
2  3번  90  100  95

In [ ]:
# df.loc[행,열]     loc : location
# df.iloc[행,열]
# [] : 특정한 범위 내에서 하나를 지정할 때 많이 사용 됨

In [11]:
data.loc[1, '국어']

68

In [13]:
data.loc[2,'수학']

95

In [14]:
# df.iloc[행위치번호,열위치번호]    iloc : index location
data.iloc[1,1]

68

In [16]:
data.iloc[1,[1,2,3]]  
#여러개를 넣고 싶으면 []를 통해서 넣어준다. 리스트로 묶어줌. 순서를 바꿀 수 있다.

국어    68
영어    95
수학    55
Name: 1, dtype: object

In [17]:
data.loc[1,['국어','수학']]
# data.loc[1,'번호':'수학']
# data.loc[[1,2],'번호':'수학']

국어    68
수학    55
Name: 1, dtype: object

In [15]:
data.iloc[1,:]

번호    2번
국어    68
영어    95
수학    55
Name: 1, dtype: object

## 컬럼 선택하기

In [19]:
data.head()

   번호  국어   영어  수학
0  1번  70   80  75
1  2번  68   95  55
2  3번  90  100  95

In [20]:
# df[컬럼정보]
data['영어']

0     80
1     95
2    100
Name: 영어, dtype: int64

In [24]:
# 국어 컬럼 + 수학컬럼
data['국어']+data['수학']

0    145
1    123
2    185
dtype: int64

In [26]:
data['수학']+3

0    78
1    58
2    98
Name: 수학, dtype: int64

In [28]:
# 국,영,수 합계 및 평균
(data['국어']+data['영어']+data['수학'])/3

0    75.000000
1    72.666667
2    95.000000
dtype: float64

In [29]:
data[['국어','영어']]

   국어   영어
0  70   80
1  68   95
2  90  100

In [30]:
# 수학, 영어
data[['수학','영어']]

   수학   영어
0  75   80
1  55   95
2  95  100

In [33]:
data = data[['수학','영어','국어','번호']]
data

   수학   영어  국어  번호
0  75   80  70  1번
1  55   95  68  2번
2  95  100  90  3번

In [34]:
data = data[['번호','국어','영어','수학']]
data

   번호  국어   영어  수학
0  1번  70   80  75
1  2번  68   95  55
2  3번  90  100  95

## 행선택

In [35]:
# [ , , ,]
# 시작: 끝  step=1
# 시작:끝:steop

In [ ]:
aaa = [1,2,3,4,5,6,7,8,9]
# aaa =

In [ ]:
#

In [36]:
data.iloc[::2,1]

0    70
2    90
Name: 국어, dtype: int64

### 행 선택하기

In [37]:
data.head()

   번호  국어   영어  수학
0  1번  70   80  75
1  2번  68   95  55
2  3번  90  100  95

In [42]:
# 수학 <80보다 작은 애들
cond = data['수학'] < 80
data[cond]  #True에 해당하는 경우만 보여줌

   번호  국어  영어  수학
0  1번  70  80  75
1  2번  68  95  55

In [45]:
# 영어가 90보다 큰 데이터만 선택
cond = data['영어']>90
data[cond]

   번호  국어   영어  수학
1  2번  68   95  55
2  3번  90  100  95

In [46]:
# 수학이 80보다 작고, 영어 90보만 큰 경우만...
cond1= data['수학']<80
cond2= data['영어']>90
cond1 & cond2

0    False
1     True
2    False
dtype: bool

In [47]:
cond1|cond2

0    True
1    True
2    True
dtype: bool

In [53]:
cond = cond1|cond2 
data[cond]

   번호  국어   영어  수학
0  1번  70   80  75
1  2번  68   95  55
2  3번  90  100  95

In [55]:
cond = (data['수학']<80) | (data['영어']>90)
data[cond]

   번호  국어   영어  수학
0  1번  70   80  75
1  2번  68   95  55
2  3번  90  100  95

In [56]:
data[(data['수학']<80) | (data['영어']>90)]

   번호  국어   영어  수학
0  1번  70   80  75
1  2번  68   95  55
2  3번  90  100  95

In [ ]:
cond = (data['수학']<80)   # 이렇게 입력하면 에러가 나는데 \를 붙이면 1줄로인식
    | (data['영어']>90)
    
cond = (data['수학']<80)\    # 여러 조건을 입력할 경우 응용 가능하다.
    | (data['영어']>90)

In [62]:
# 영어점수가 70 점 이상
# 수학점수가 70점 이상
# 수학점수가 90점 미만  모든 조건을 만족하는 데이터

cond = (data['영어']>=70)\
    & (data['수학']>=70)\
    &(data['수학']<90)
data[cond]

   번호  국어  영어  수학
0  1번  70  80  75

In [65]:
cond=[]
for math in data['수학']:
#    print(math)
    if math > 80:
        check=True
    else:
        check=False
    cond.append(check)
cond    

## cond = [True, False, False]
# data[cond]

[False, False, True]

## 인덱스, 컬럼

In [66]:
data.columns  #데이터가 가진 컬럼명 확인

Index(['번호', '국어', '영어', '수학'], dtype='object')

In [ ]:
data.columns=['번호', 'K','E','M']
data

In [ ]:
# 중간에 한개만 바꾸고 싶은 경우, 조회 후 변경

In [ ]:
data.columns=[['번호', '국어', '영어', 'math']]
data

In [67]:
data.index

RangeIndex(start=0, stop=3, step=1)

In [68]:
# 값 넣기 
data.index = ['1반','2반','3반']
data

    번호  국어   영어  수학
1반  1번  70   80  75
2반  2번  68   95  55
3반  3번  90  100  95

In [69]:
# df 에서 컬럼과 인덱스간 왔다갔다 할 수 있다.
# df  인덱스 --> 컬럼   : df.reset_index()
#data.reset_index()     # 다시 할당을 해야 적용이 된다.
# 괄호 사이에서 shift+Tab을 하면 사용법을 알 수 있다.

data.reset_index

  index  번호  국어   영어  수학
0    1반  1번  70   80  75
1    2반  2번  68   95  55
2    3반  3번  90  100  95

In [70]:
data  #판다스는 원본 데이터를 다 바꾸지 않는 편...

    번호  국어   영어  수학
1반  1번  70   80  75
2반  2번  68   95  55
3반  3번  90  100  95

In [71]:
# 괄호 사이에서 shift+Tab을 하면 사용법을 알 수 있다.

data.reset_index(drop=True)

   번호  국어   영어  수학
0  1번  70   80  75
1  2번  68   95  55
2  3번  90  100  95

In [72]:
# df. 컬럼 -- 인덱스  : df.set_index()
data.set_index('번호')  #인덱스 이름 변경 가능

    국어   영어  수학
번호
1번  70   80  75
2번  68   95  55
3번  90  100  95

In [73]:
# 컬럼 추가 ....
data['미술'] = 90
data

<ipython-input-73-0c33b2a5ad7c>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['미술'] = 90

    번호  국어   영어  수학  미술
1반  1번  70   80  75  90
2반  2번  68   95  55  90
3반  3번  90  100  95  90

In [75]:
score_list = [10,20,30]
data['체육'] = score_list
data

<ipython-input-75-66a1a5223dde>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['체육'] = score_list

    번호  국어   영어  수학  미술  체육
1반  1번  70   80  75  90  10
2반  2번  68   95  55  90  20
3반  3번  90  100  95  90  30

In [76]:
data.sum()  # 기본값: 열로 더해줌

번호    1번2번3번
국어       228
영어       275
수학       225
미술       270
체육        60
dtype: object

In [78]:
data['합계'] = data.sum(axis = 1)  # 축을 입력해 주면 행 단위로 더해준다. 문자는 빼준다.
data

<ipython-input-78-4bcce01ddd1a>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['합계'] = data.sum(axis = 1)  # 축을 입력해 주면 행 단위로 더해준다. 문자는 빼준다.

    번호  국어   영어  수학  미술  체육   합계
1반  1번  70   80  75  90  10  325
2반  2번  68   95  55  90  20  328
3반  3번  90  100  95  90  30  405

한번 더 실행하면 2번 계산이 되어 배가 되므로 주의

In [79]:
data['평균'] = data['합계']/5  # 축을 입력해 주면 행 단위로 더해준다. 문자는 빼준다.
data

<ipython-input-79-736b57c5386e>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['평균'] = data['합계']/5  # 축을 입력해 주면 행 단위로 더해준다. 문자는 빼준다.

    번호  국어   영어  수학  미술  체육   합계    평균
1반  1번  70   80  75  90  10  325  65.0
2반  2번  68   95  55  90  20  328  65.6
3반  3번  90  100  95  90  30  405  81.0

In [ ]:
# df.loc[형, 열]  # 2차원 정보라는 의미 ML의 경우 차원이 더 많아 질 수 있다.


# data.mean(axis=0)  # axis=0 행이 바뀐다는 의미 axis=1 은

### 저장하기

In [80]:
#data.to_excel('./판다스샘플.xlsx')

    번호  국어   영어  수학  미술  체육   합계    평균
1반  1번  70   80  75  90  10  325  65.0
2반  2번  68   95  55  90  20  328  65.6
3반  3번  90  100  95  90  30  405  81.0

In [ ]:
#data.to_excel('./판다스샘플.xlsx', index = False)  
# index = False  인덱스 제외 저장